In [369]:
# The dataset shows monthly property transactions (MPT) throught the United Kingdom. This dataset looks at monthly property 
# transactions completed in the UK with value of Â£40,000 or above.

#I will be analysing the data and showing my findings
# in graphs, visualising the datatset.

#What i will be finding in my analysis:
# Analysing trends each year to identify patterns.
# Comparing yearly transactions to identify growths and declines.
# grouping transactions by regions to see which has the most or least transactions
# I will be making predictions using linear regression, i will the present my findings in a viusal form such as seaborn, bar plot, scatter plot. 

#Reference:
#All data has been sourced from the goverment website
# link: https://assets.publishing.service.gov.uk/media/66f17eccbd3aced9da489c15/MPT_Tab_Sep_24.ods

In [47]:
# Importing necessary libraries for this project.

import pandas as pd
from pandas import DataFrame, Series
import numpy as np
from matplotlib import pyplot as plt

In [49]:
# Saving the datatset to a dataframe.
df = pd.read_csv('MPT_Tab_Sep_24.csv')

In [51]:
# Printing first 5 rows of the data.

df.head()

,Month and year,England,Scotland,Wales,Northern Ireland,UK,UK (seasonally adjusted)
0,April 2005,"88,840","10,540","4,520","3,290","107,190","109,680"
1,May 2005,"91,030","10,180","4,540","3,260","109,010","110,270"
2,June 2005,"103,700","12,120","5,050","3,790","124,660","112,460"
3,July 2005,"107,770","12,530","5,160","3,710","129,170","113,610"
4,August 2005,"107,040","12,000","5,200","3,910","128,150","115,470"

In [53]:
# Exploring the dataset using functions like shape, head(), describe(), and dtypes() to understand its structure.

df.shape

(262, 7)

In [55]:
df.describe()

,Month and year,England,Scotland,Wales,Northern Ireland,UK,UK (seasonally adjusted)
count,234,233,233,233,233,233,233
unique,234,229,208,170,151,232,227
top,April 2005,"87,040","6,830","3,430","1,720","91,270","106,250"
freq,1,2,3,4,5,2,2

In [57]:
df.dtypes

Month and year              object
England                     object
Scotland                    object
Wales                       object
Northern Ireland            object
UK                          object
UK (seasonally adjusted)    object
dtype: object

In [59]:
df.tail()

,Month and year,England,Scotland,Wales,Northern Ireland,UK,UK (seasonally adjusted)
257,NaN,NaN,NaN,NaN,NaN,NaN,NaN
258,NaN,NaN,NaN,NaN,NaN,NaN,NaN
259,NaN,NaN,NaN,NaN,NaN,NaN,NaN
260,NaN,NaN,NaN,NaN,NaN,NaN,NaN
261,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [61]:
df.isnull().sum().sum()

202

In [63]:
# indetifying missing values

In [67]:
#It seems the spreadsheet for this data has empty rows, I will clean this up.
df = df.drop(df.index[233:261])

In [69]:
#confrim changes
df.tail()

,Month and year,England,Scotland,Wales,Northern Ireland,UK,UK (seasonally adjusted)
228,April 2024,"64,730","7,890","3,310","1,680","77,610","89,450"
229,May 2024,"77,380","9,240","3,910","2,170","92,700","91,840"
230,June 2024 [provisional],"75,860","8,760","3,990","2,020","90,630","91,250"
231,July 2024 [provisional],"81,730","8,940","4,280","1,990","96,940","90,610"
232,August 2024 [provisional estimates],"87,430","9,860","4,520","2,520","104,330","90,210"

In [71]:
df.isnull().sum().sum()

0

In [73]:
# I will be analysing transactions from years 2005 - 2010 in England region.

ten_years = df.loc[:70][['Month and year', 'England', 'UK (seasonally adjusted)']]

In [75]:
ten_years_grouped = ten_years.groupby('Month and year').sum().reset_index()

In [87]:
ten_years_grouped_int = ten_years_grouped.head(29)

In [93]:
ten_years_grouped_int.head(20)

   Month and year  England UK (seasonally adjusted)
0      April 2005   88,840                  109,680
1      April 2006  101,830                  135,880
2      April 2007  105,780                  136,980
3      April 2008   73,130                   94,610
4      April 2009   48,840                   62,120
5      April 2010   60,830                   75,280
6     August 2005  107,040                  115,470
7     August 2006  132,180                  142,280
8     August 2007  136,790                  137,040
9     August 2008   57,810                   61,820
10    August 2009   68,080                   75,400
11    August 2010   70,320                   74,620
12  December 2005  115,150                  126,640
13  December 2006  133,770                  149,510
14  December 2007   91,140                  109,440
15  December 2008   50,260                   56,400
16  December 2009   89,920                   98,940
17  December 2010   65,650                   67,530
18  February 2006   87,550                  133,940
19  February 2007   96,560                  147,120